[
    "Every year, nearly four million cats are eaten in Asia",
	"On average, cats spend 2/3 of every day sleeping",
	"Unlike dogs, cats do not have a sweet tooth",
	"When a cat chases its prey, it keeps its head level",
	"The technical term for a cat's hairball is a bezoar",
	"A group of cats is called a clowder",
	"Female cats tend to be right pawed, while male cats are more often left pawed",
	"A cat cannot climb head first down a tree because its claws are curved the wrong way",
	"Cats make about 100 different sounds",
	"A cat's brain is biologically more similar to a human brain than it is to a dog's",
	"There are more than 500 million domestic cats in the world",
	"Approximately 24 cat skins can make a coat",
	"During the Middle Ages, cats were associated with witchcraft",
	"Cats are the most popular pet in North American Cats are North America's most popular pets",
	"Approximately 40,000 people are bitten by cats in the U.S.",
	"A cat's hearing is better than a dog's",
	"A cat can travel at a top speed of approximately 31 mph (49 km) over a short distance",
	"A cat can jump up to five times its own height in a single bound",
	"Some cats have survived falls of over 20 meters",
	"Researchers are unsure exactly how a cat purrs",
	"When a family cat died in ancient Egypt, family members would mourn by shaving off their eyebrows",
	"In 1888, more than 300,000 mummified cats were found an Egyptian cemetery",
	"Most cats give birth to a litter of between one and nine kittens",
	"Smuggling a cat out of ancient Egypt was punishable by death",
	"The earliest ancestor of the modern cat lived about 30 million years ago",
	"The biggest wildcat today is the Siberian Tiger",
	"The smallest wildcat today is the Black-footed cat",
	"Many Egyptians worshipped the goddess Bast, who had a woman's body and a cat's head",
	"Mohammed loved cats and reportedly his favorite cat, Muezza, was a tabby",
	"The smallest pedigreed cat is a Singapura, which can weigh just 4 lbs",
	"Cats hate the water because their fur does not insulate well when it's wet",
	"The Egyptian Mau is probably the oldest breed of cat",
	"A cat usually has about 12 whiskers on each side of its face",
	"A cat's eyesight is both better and worse than humans",
	"A cat's jaw can't move sideways, so a cat can't chew large chunks of food",
	"A cat almost never meows at another cat, mostly just humans",
	"A cat's back is extremely flexible because it has up to 53 loosely fitting vertebrae",
	"Many cat owners think their cats can read their minds",
	"Two members of the cat family are distinct from all others: the clouded leopard and the cheetah",
	"In Japan, cats are thought to have the power to turn into super spirits when they die",
	"Most cats had short hair until about 100 years ago, when it became fashionable to own cats and experiment with breeding",
	"Cats have 32 muscles that control the outer ear",
	"Cats have about 20,155 hairs per square centimeter",
	"The first cat show was organized in 1871 in London",
	"A cat has 230 bones in its body",
	"Foods that should not be given to cats include onions, garlic, green tomatoes, raw potatoes, chocolate, grapes, and raisins",
	"A cat's heart beats nearly twice as fast as a human heart",
	"Cats spend nearly 1/3 of their waking hours cleaning themselves",
	"Grown cats have 30 teeth",
	"The largest cat breed by mean weight is the Savannah, at 10kg",
	"Cats are extremely sensitive to vibrations",
	"The cat who holds the record for the longest non-fatal fall is Andy",
	"The richest cat is Blackie who was left £15 million by his owner, Ben Rea",
	"Around the world, cats take a break to nap —a catnap— 425 million times a day",
	"In homes with more than one cat, it is best to have cats of the opposite sex. They tend to be better housemates.",
	"Cats are unable to detect sweetness in anything they taste",
	"Perhaps the oldest cat breed on record is the Egyptian Mau, which is also the Egyptian language's word for cat",
	"In one litter of kittens, there could be multiple father cats",
	"Teeth of cats are sharper when they're kittens. After six months, they lose their needle-sharp milk teeth",
	"Collectively, kittens yawn about 200 million time per hour",
	"According to the International Species Information Service, there are only three Marbled Cats still in existence worldwide.  One lives in the United States.",
	"Cats show affection and mark their territory by rubbing on people. Glands on their face, tail and paws release a scent to make its mark",
	"Maine Coons are the most massive breed of house cats. They can weigh up to around 24 pounds",
	"If you killed a cat in the ages of Pharaoh, you could've been put to death",
	"Most cats will eat 7 to 20 small meals a day. This interesting fact is brought to you by Nature's Recipe®",
	"Most cats don't have eyelashes",
	"Call them wide-eyes: cats are the mammals with the largest eyes",
	"Cats who eat too much tuna can become addicted, which can actually cause a Vitamin E deficiency",
	"Cats can pick up on your tone of voice, so sweet-talking to your cat has more of an impact than you think",
	"Some cats can survive falls from as high up as 65 feet or more",
	"Genetically, cats' brains are more similar to that of a human than a dog's brain",
	"If your cat's eyes are closed, it's not necessarily because it's tired. A sign of closed eyes means your cat is happy or pleased",
	"Cats CAN be lefties and righties, just like us. More than forty percent of them are, leaving some ambidextrous",
	"Cats have the skillset that makes them able to learn how to use a toilet",
	"Each side of a cat's face has about 12 whiskers",
	"Landing on all fours is something typical to cats thanks to the help of their eyes and special balance organs in their inner ear. These tools help them straighten themselves in the air and land upright on the ground.",
	"Eating grass rids a cats' system of any fur and helps with digestion",
	"Cats have 24 more bones than humans",
	"Black cats aren't an omen of ill fortune in all cultures. In the UK and Australia, spotting a black cat is good luck",
	"The Maine Coon is appropriately the official State cat of its namesake state",
	"The world's most fertile cat, whose name was Dusty, gave birth to 420 kittens in her lifetime",
	"Sometimes called the Canadian Hairless, the Sphynx is the first cat breed that has lasted this long—the breed has been around since 1966",
	"Sir Isaac Newton, among his many achievements, invented the cat flap door",
	"In North America, cats are a more popular pet than dogs. Nearly 73 million cats and 63 million dogs are kept as household pets",
	"Today, cats are living twice as long as they did just 50 years ago",
	"Outdoor cats' lifespan averages at about 3 to 5 years; indoor cats have lives that last 16 years or more",
	"Cats have the cognitive ability to sense a human's feelings and overall mood",
	"Cats prefer their food at room temperature—not too hot, not too cold",
	"Bobtails are known to have notably short tails -- about half or a third the size of the average cat",
	"A fingerprint is to a human as a nose is to a cat",
	"Cats have over 100 sounds in their vocal repertoire, while dogs only have 10",
	"Cats came to the Americas from Europe as pest controllers in the 1750s",
	"According to the Association for Pet Obesity Prevention (APOP), about 50 million of our cats are overweight",
	"Cats use their whiskers to measure openings, indicate mood and general navigation",
	"Blue-eyed cats have a high tendency to be deaf, but not all cats with blue eyes are deaf",
	"Ancient Egyptians first adored cats for their finesse in killing rodents—as far back as 4,000 years ago",
	"The color of York Chocolates becomes richer with age. Kittens are born with a lighter coat than the adults",
	"Because of widespread cat smuggling in ancient Egypt, the exportation of cats was a crime punishable by death",
	"Cats actually have dreams, just like us. They start dreaming when they reach a week old",
	"It is important to include fat in your cat's diet because they're unable to make the nutrient in their bodies on their own",
	"A cat's field of vision does not cover the area right under its nose",
	"Talk about Facetime: Cats greet one another by rubbing their noses together",
	"Cats sleep 16 hours of any given day",
	"Although it is known to be the tailless cat, the Manx can be born with a stub or a short tail",
	"A Selkirk slowly loses its naturally-born curly coat, but it grows again when the cat is around 8 months",
	"A cat's heart beats almost double the rate of a human heart, from 110 to 140 beats per minute",
	"Ragdoll cats live up to their name: they will literally go limp, with relaxed muscles, when lifted by a human",
	"Unlike most other cats, the Turkish Van breed has a water-resistant coat and enjoys being in water",
	"Webbed feet on a cat? The Peterbald's got 'em! They make it easy for the cat to get a good grip on things with skill",
	"Despite appearing like a wild cat, the Ocicat does not have an ounce of wild blood",
	"Cat's back claws aren't as sharp as the claws on their front paws",
	"A group of kittens is called a kindle, and clowder is a term that refers to a group of adult cats",
	"A third of cats' time spent awake is usually spent cleaning themselves",
	"A female cat is also known to be called a queen or a molly",
	"Want to call a hairball by its scientific name? Next time, say the word bezoar",
	"Cats have a 5 toes on their front paws and 4 on each back paw",
	"In multi-pet households, cats are able to get along especially well with dogs if they're introduced when the cat is under 6 months old and the dog is under one year old",
	"Twenty-five percent of cat owners use a blow drier on their cats after bathing",
	"Rather than nine months, cats' pregnancies last about nine weeks",
	"It has been said that the Ukrainian Levkoy has the appearance of a dog, due to the angles of its face",
	"A cat can reach up to five times its own height per jump",
	"Cats have a strong aversion to anything citrus",
	"Cats would rather starve themselves than eat something they don't like. This means they will refuse an unpalatable -- but nutritionally complete -- food for a prolonged period",
	"The Snow Leopard, a variety of the California Spangled Cat, always has blue eyes",
	"The two outer layers of a cat's hair are called, respectively, the guard hair and the awn hair",
	"When a household cat died in ancient Egypt, its owners showed their grief by shaving their eyebrows",
	"Caution during Christmas: poinsettias may be festive, but they’re poisonous to cats",
	"Most kittens are born with blue eyes, which then turn color with age",
	"A cat's meow is usually not directed at another cat, but at a human. To communicate with other cats, they will usually hiss, purr and spit.",
	"According to the Guinness World Records, the largest domestic cat litter totaled at 19 kittens, four of them stillborn",
	"As temperatures rise, so do the number of cats. Cats are known to breed in warm weather, which leads many animal advocates worried about the plight of cats under Global Warming.",
	"Cats' rough tongues enable them to clean themselves efficiently and to lick clean an animal bone",
	"Most cat litters contain four to six kittens",
	"A Japanese cat figurine called Maneki-Neko is believed to bring good luck",
	"One of Muhammad's companions was nicknamed Abu Hurairah, or Father of the Kitten, because he loved cats",
    "Elvis Presley’s Chinese name is Mao Wong, or Cat King",
    "A 2007 Gallup poll revealed that both men and women were equally likely to own a cat.",
    "A cat almost never meows at another cat, mostly just humans. Cats typically will spit, purr, and hiss at other cats.",
    "A cat called Dusty has the known record for the most kittens. She had more than 420 kittens in her lifetime.",
    "A cat can jump 5 times as high as it is tall.",
    "A cat can jump up to five times its own height in a single bound.",
    "A cat can spend five or more hours a day grooming himself.",
    "A cat can sprint at about thirty-one miles per hour.",
    "A cat can travel at a top speed of approximately 31 mph (49 km) over a short distance.", 
    "A cat cannot see directly under its nose.", 
    "A cat can’t climb head first down a tree because every claw on a cat’s paw points the same way. To get down from a tree, a cat must back down.",
    "A cat has 230 bones in its body. A human has 206. A cat has no collarbone, so it can fit through any opening the size of its head.",
    "A cat has approximately 60 to 80 million olfactory cells (a human has between 5 and 20 million).",
    "A cat has more bones than a human being; humans have 206 and the cat has 230 bones.",
    "A cat has two vocal chords, and can make over 100 sounds.",
    "A cat lover is called an Ailurophilia (Greek: cat+lover).",
    "A cat named Dusty, aged 1 7, living in Bonham, Texas, USA, gave birth to her 420th kitten on June 23, 1952.",
    "A cat rubs against people not only to be affectionate but also to mark out its territory with scent glands around its face.The tail area and paws also carry the cat’s scent.",
    "A cat sees about 6 times better than a human at night, and needs 1/6 the amount of of light that a human does - it has a layer of extra reflecting cells which absorb light.",
    "A cat uses its whiskers for measuring distances.  The whiskers of a cat are capable of registering very small changes in air pressure.",
    "A cat usually has about 12 whiskers on each side of its face.",
    "A cat will tremble or shiver when it is in extreme pain.",
    "A cat's appetite is the barometer of its health. Any cat that does not eat or drink for more than two days should be taken to a vet.",
    "A cat's brain is more similar to a man's brain than that of a dog.",
    "A cat's field of vision is about 200 degrees.",
    "A cat's hearing is much more sensitive than humans and dogs.",
    "A cat's jaw has only up and down motion; it does not have any lateral, side to side motion, like dogs and humans.",
    "A cat's normal temperature varies around 101 F // 38 C.",
    "A cat's whiskers are thought to be a kind of radar, which helps a cat gauge the space it intends to walk through.",
    "A cats field of vision is about 185 degrees.",
    "A cat’s back is extremely flexible because it has up to 53 loosely fitting vertebrae. Humans only have 34.",
    "A cat’s brain is biologically more similar to a human brain than it is to a dog’s. Both humans and cats have identical regions in their brains that are responsible for emotions.",
    "A cat’s eyesight is both better and worse than humans. It is better because cats can see in much dimmer light and they have a wider peripheral view. It’s worse because they don’t see color as well as humans do. Scientists believe grass appears red to cats.",
    "A cat’s hearing is better than a dog’s. And a cat can hear high-frequency sounds up to two octaves higher than a human.",
    "A cat’s heart beats nearly twice as fast as a human heart, at 110 to 140 beats a minute.",
    "A cat’s jaw can’t move sideways, so a cat can’t chew large chunks of food.",
    "A cat’s nose pad is ridged with a unique pattern, just like the fingerprint of a human.",
    "A commemorative tower was built in Scotland for a cat named Towser, who caught nearly 30,000 mice in her lifetime.",
    "A domestic cat can run at speeds of 30 mph.",
    "A female cat is called a queen or a molly.",
    "A female cat will be pregnant for approximately 9 weeks or between 62 and 65 days from conception to delivery.",
    "A form of AIDS exists in cats.",
    "A group of cats is called a 'clowder'.",
    "A happy cat holds her tail high and steady.",
    "A healthy cat has a temperature between 38 and 39 degrees Celcius.",
    "A kitten will typically weigh about 3 ounces at birth.  The typical male housecat will weigh between  7 and 9 pounds, slightly less for female housecats.",
    "A queen (female cat) can begin mating when she is between 5 and 9 months old.",
    "A sexually-active feral tom-cat 'owns' an area of about three square miles and 'sprays' to mark his territory with strong smelling urine.",
    "A steady diet of dog food may cause blindness in your cat - it lacks taurine.",
    "A tiger's stripes are like fingerprints.",
    "A tomcat (male cat) can begin mating when he is between 7 and 10 months old.",
    "About 37% of American homes today have at least 1 cat.",
    "Abraham Lincoln loved cats. He had four of them while he lived in the White House.",
    "According to Hebrew legend, Noah prayed to God for help protecting all the food he stored on the ark from being eaten by rats. In reply, God made the lion sneeze, and out popped a cat.",
    "According to a Gallup poll, most American pet owners obtain their cats by adopting strays.",
    "After humans, mountain lions have the largest range of any mammal in the Western Hemisphere.",
    "Ailurophile is the word cat lovers are officially called.",
    "All cats have claws, and all except the cheetah sheath them when at rest.",
    "All cats have three sets of long hairs that are sensitive to pressure - whiskers, eyebrows,and the hairs between their paw pads.",
    "All cats need taurine in their diet to avoid blindness. Cats must also have fat in their diet as they are unable to produce it on their own.",
    "Among many other diseases, cats can suffer from anorexia, senility, feline AIDS and acne.",
    "An adult lion's roar can be heard up to five miles (eight kilometers) away.",
    "Ancient Egyptian family members shaved their eyebrows in mourning when the family cat died.",
    "Approximately 1/3 of cat owners think their pets are able to read their minds.",
    "Approximately 24 cat skins can make a coat.",
    "Approximately 40,000 people are bitten by cats in the U.S. annually.",
    "At 4 weeks, it is important to play with kittens so that they do not develope a fear of people.",
    "Baking chocolate is the most dangerous chocolate to your cat.",
    "Blue-eyed, pure white cats are frequently deaf.",
    "Both humans and cats have identical regions in the brain responsible for emotion.",
    "British cat owners spend roughly 550 million pounds yearly on cat food.",
    "Cat bites are more likely to become infected than dog bites.",
    "Cat families usually play best in even numbers. Cats and kittens should be acquired in pairs whenever possible.",
    "Cat paws act as temperature regulators, shock absorbers, hunting and grooming tools, sensors, and more.",
    "Cat's urine glows under a black light.",
    "Cats and kittens should be acquired in pairs whenever possible as cat families interact best in pairs.",
    "Cats are North America’s most popular pets: there are 73 million cats compared to 63 million dogs. Over 30% of households in North America own a cat.",
    "Cats are extremely sensitive to vibrations. Cats are said to detect earthquake tremors 10 or 15 minutes before humans can.",
    "Cats are now Britain's favorite pet: there are 7.7 million cats as opposed to 6.6 million dogs.",
    "Cats are subject to gum disease and to dental caries. They should have their teeth cleaned by the vet or the cat dentist once a year.",
    "Cats are the world's most popular pets, outnumbering dogs by as many as three to one.",
    "Cats bury their feces to cover their trails from predators.",
    "Cats can be right-pawed or left-pawed.",
    "Cats can be taught to walk on a leash, but a lot of time and patience is required to teach them. The younger the cat is, the easier it will be for them to learn.",
    "Cats can judge within 3 inches the precise location of a sound being made 1 yard away.",
    "Cats can jump up to 7 times their tail length.",
    "Cats can predict earthquakes. We humans are not 100% sure how they do it. There are several different theories.",
    "Cats can rotate their ears 180 degrees.",
    "Cats come back to full alertness from the sleep state faster than any other creature.",
    "Cats control the outer ear using 32 muscles; humans use 6.",
    "Cats dislike citrus scent.",
    "Cats do not think that they are little people. They think that we are big cats. This influences their behavior in many ways.",
    "Cats don’t have sweat glands over their bodies like humans do. Instead, they sweat only through their paws.",
    "Cats eat grass to aid their digestion and to help them get rid of any fur in their stomachs.",
    "Cats hate the water because their fur does not insulate well when it’s wet. The Turkish Van, however, is one cat that likes swimming. Bred in central Asia, its coat has a unique texture that makes it water resistant.",
    "Cats have 'nine lives' thanks to a flexible spine and powerful leg and back muscles.",
    "Cats have 30 teeth (12 incisors, 10 premolars, 4 canines, and 4 molars), while dogs have 42. Kittens have baby teeth, which are replaced by permanent teeth around the age of 7 months.",
    "Cats have 30 vertebrae (humans have 33 vertebrae during early development; 26 after the sacral and coccygeal regions fuse).",
    "Cats have 300 million neurons; dogs have about 160 million.",
    "Cats have 32 muscles that control the outer ear (compared to human's 6 muscles each). A cat can rotate its ears independently 180 degrees, and can turn in the direction of sound 10 times faster than those of the best watchdog.",
    "Cats have about 130,000 hairs per square inch (20,155 hairs per square centimeter).",
    "Cats have been domesticated for half as long as dogs have been.",
    "Cats have individual preferences for scratching surfaces and angles. Some are horizontal scratchers while others exercise their claws vertically.",
    "Cats have supersonic hearing.",
    "Cats have the largest eyes of any mammal.",
    "Cats lap liquid from the underside of their tongue, not from the top.",
    "Cats lived with soldiers in trenches, where they killed mice during World War I.",
    "Cats lose almost as much fluid in the saliva while grooming themselves as they do through urination.",
    "Cats make about 100 different sounds. Dogs make only about 10.",
    "Cats must have fat in their diet because they can't produce it on their own.",
    "Cats often overreact to unexpected stimuli because of their extremely sensitive nervous system.",
    "Cats purr at the same frequency as an idling diesel engine, about 26 cycles per second.",
    "Cats respond better to women than to men, probably due to the fact that women's voices have a higher pitch.",
    "Cats respond most readily to names that end in an 'ee' sound.",
    "Cats see six times better in the dark and at night than humans.",
    "Cats should not be fed tuna exclusively, as it lacks taurine, an essential nutrient required for good feline health.  Make sure you have the proper Pet supplies to keep your cat happy and healthy.",
    "Cats sleep 16 to 18 hours per day. When cats are asleep, they are still alert to incoming stimuli. If you poke the tail of a sleeping cat, it will respond accordingly.",
    "Cats spend nearly 1/3 of their waking hours cleaning themselves.",
    "Cats step with both left legs, then both right legs when they walk or run.",
    "Cats take between 20-40 breaths per minute.",
    "Cats that live together sometimes rub each others heads to show that they have no intention of fighting. Young cats do this more often, especially when they are excited.",
    "Cats walk on their toes.",
    "Cats with long, lean bodies are more likely to be outgoing, and more protective and vocal than those with a stocky build.",
    "Cats' eyes shine in the dark because of the tapetum, a reflective layer in the eye, which acts like a mirror.",
    "Cats' hearing is much more sensitive than humans and dogs.",
    "Cats' hearing stops at 65 khz (kilohertz); humans' hearing stops at 20 khz.",
    "Cats, especially older cats, do get cancer. Many times this disease can be treated successfully.",
    "Cats, just like people, are subject to asthma. Dust, smoke, and other forms of air pollution in your cat's environment can be troublesome sources of irritation.",
    "Cheetahs do not roar, as the other big cats do. Instead, they purr.",
    "Contrary to popular belief, the cat is a social animal. A pet cat will respond and answer to speech, and seems to enjoy human companionship.",
    "Domestic cats spend about 70 percent of the day sleeping, and 15 percent of the day grooming.",
    "During the Middle Ages, cats were associated with witchcraft, and on St. John’s Day, people all over Europe would stuff them into sacks and toss the cats into bonfires. On holy days, people celebrated by tossing cats from church towers.",
    "During the time of the Spanish Inquisition, Pope Innocent VIII condemned cats as evil and thousands of cats were burned. Unfortunately, the widespread killing of cats led to an explosion of the rat population, which exacerbated the effects of the Black Death.",
    "Edward Lear, author of 'The Owl and the Pussycat', is said to have had his new house in San Remo built to exactly the same specification as his previous residence, so that his much-loved tabby, Foss, would immediately feel at home.",
    "Every time you masturbate God kills a kitten. Please, think of the kittens.",
    "Every year, nearly four million cats are eaten in Asia.",
    "Female cats tend to be right pawed, while male cats are more often left pawed. Interestingly, while 90% of humans are right handed, the remaining 10% of lefties also tend to be male.",
    "Florence Nightingale owned more than 60 cats in her lifetime.",
    "Foods that should not be given to cats include onions, garlic, green tomatoes, raw potatoes, chocolate, grapes, and raisins. Though milk is not toxic, it can cause an upset stomach and gas. Tylenol and aspirin are extremely toxic to cats, as are manycommon houseplants. Feeding cats dog food or canned tuna that’s for human consumption can cause malnutrition.",
    "Fossil records from two million years ago show evidence of jaguars.",
    "Grown cats have 30 teeth. Kittens have about 26 temporary teeth, which they lose when they are about 6 months old.",
    "Heat occurs several times a year and can last anywhere from 3 to 15 days.",
    "If a cat is frightened, the hair stands up fairly evenly all over the body; when the cat is threatened or is ready to attack, the hair stands up only in a narrow band along the spine and tail.",
    "If they have ample water, cats can tolerate temperatures up to 133 °F.",
    "If your cat snores, or rolls over on his back to expose his belly, it means he trusts you.",
    "In 1888, more than 300,000 mummified cats were found an Egyptian cemetery. They were stripped of their wrappings and cartedoff to be used by farmers in England and the U.S. for fertilizer.",
    "In 1987, cats overtook dogs as the number one pet in America (about 50 million cats resided in 24 million homes in 1986). About 37% of American homes today have at least one cat.",
    "In Holland’s embassy in Moscow, Russia, the staff noticed that the two Siamese cats kept meowing and clawing at the walls of the building. Their owners finally investigated, thinking they would find mice. Instead, they discovered microphones hidden by Russian spies. The cats heard the microphones when they turned on.",
    "In Japan, cats are thought to have the power to turn into super spirits when they die. This may be because according to the Buddhist religion, the body of the cat is the temporary resting place of very spiritual people.",
    "In Siam, the cat was so revered that one rode in a chariot at the head of a parade celebrating the new king.",
    "In an average year, cat owners in the United States spend over $2 billion on cat food.",
    "In ancient Egypt, mummies were made of cats, and embalmed mice were placed with them in their tombs. In one ancient city, over 300,000 cat mummies were found.",
    "In ancient Egypt, when a family cat died, all family members would shave their eyebrows as a sign of mourning.",
    "In contrast to dogs, cats have not undergone major changes during their domestication process.",
    "In just seven years, a single pair of cats and their offspring could produce a staggering total of 420,000 kittens.",
    "In multi-cat households, cats of the opposite sex usually get along better.",
    "In one stride, a cheetah can cover 23 to 26 feet (7 to 8 meters).",
    "In relation to their body size, cats have the largest eyes of any mammal.",
    "In the 1750s, Europeans introduced cats into the Americas to control pests.",
    "In the 1930s, two Russian biologists discovered that color change in Siamese kittens depend on their body temperature. Siamese cats carry albino genes that work only when the body temperature is above 98° F. If these kittens are left in a very warm room, their points won’t darken and they will stay a creamy white.",
    "In the largest cat breed, the average male weighs approximately 20 pounds.",
    "In the original Italian version of Cinderella, the benevolent fairy godmother figure was a cat.",
    "Isaac Newton invented the cat flap. Newton was experimenting in a pitch-black room. Spithead, one of his cats, kept opening the door and wrecking his experiment. The cat flap kept both Newton and Spithead happy.",
    "It has been scientifically proven that owning cats is good for our health and can decrease the occurrence of high blood pressure and other illnesses.",
    "It has been scientifically proven that stroking a cat can lower one's blood pressure.",
    "It may take as long as 2 weeks for a kitten to be able to hear well.  Their eyes usually open between 7 and 10 days, but sometimes it happens in as little as 2 days.",
    "Jaguars are the only big cats that don't roar.",
    "Julius Caesar, Henri II, Charles XI, and Napoleon were all afraid of cats.",
    "Kittens remain with their mother till the age of 9 weeks.",
    "Kittens who are taken along on short, trouble-free car trips to town tend to make good passengers when they get older. They get used to the sounds and motions of traveling and make less connection between the car and the visits to the vet.",
    "Like birds, cats have a homing ability that uses its biological clock, the angle of the sun, and the Earth's magnetic field. A cat taken far from its home can return to it. But if a cat's owners move far from its home, the cat can't find them.",
    "Like humans, cats tend to favor one paw over another.",
    "Lions are the only cats that live in groups, called prides. Every female within the pride is usually related.",
    "Long, muscular hind legs enable snow leopards to leap seven times their own body length in a single bound.",
    "Many Egyptians worshipped the goddess Bast, who had a woman’s body and a cat’s head.",
    "Many cats cannot properly digest cow's milk. Milk and milk products give them diarrhea.",
    "Many cats love having their forehead gently stroked.",
    "Many people in China consider cats a 'warming' food that is perfect to eat during the winter.",
    "Miacis, the primitive ancestor of cats, was a small, tree-living creature of the late Eocene period, some 45 to 50 million years ago.",
    "Milk can give some cats diarrhea.",
    "Most cats adore sardines.",
    "Most cats give birth to a litter of between one and nine kittens. The largest known litter ever produced was 19 kittens, of which 15 survived.",
    "Most cats had short hair until about 100 years ago, when it became fashionable to own cats and experiment with breeding.",
    "Most cats sleep around 16 hours a day.",
    "Mountain lions are strong jumpers, thanks to muscular hind legs that are longer than their front legs.",
    "Neutering a cat extends its life span by two or three years.",
    "Neutering a male cat will, in almost all cases, stop him from spraying (territorial marking), fighting with other males (atleast over females), as well as lengthen his life and improve its quality.",
    "Not every cat gets 'high' from catnip. Whether or not a cat responds to it depends upon a recessive gene.",
    "Of all the species of cats, the domestic cat is the only species able to hold its tail vertically while walking. All species of wild cats hold their tail horizontally or tucked between their legs while walking.",
    "One reason that kittens sleep so much is because a growth hormone is released only during sleep.",
    "People who are allergic to cats are actually allergic to cat saliva or to cat dander. If the resident cat is bathed regularly the allergic people tolerate it better.",
    "Perhaps the most famous comic cat is the Cheshire Cat in Lewis Carroll’s Alice in Wonderland. With the ability to disappear, this mysterious character embodies the magic and sorcery historically associated with cats.",
    "Phoenician cargo ships are thought to have brought the first domesticated cats to Europe in about 900 BC.",
    "Purring does not always indicate that a cat is happy. Cats will also purr loudly when they are distressed or in pain.",
    "Relative to its body size, the clouded leopard has the biggest canines of all animals’ canines. Its dagger-like teeth can be as long as 4.5 cm (1.8 in).",
    "Researchers are unsure exactly how a cat purrs. Most veterinarians believe that a cat purrs by vibrating vocal folds deep in the throat. To do this, a muscle in the larynx opens and closes the air passage about 25 times per second.",
    "Researchers believe the word “tabby” comes from Attabiyah, a neighborhood in Baghdad, Iraq. Tabbies got their name because their striped coats resembled the famous wavy patterns in the silk produced in this city.",
    "Retractable claws are a physical phenomenon that sets cats apart from the rest of the animal kingdom. In the cat family, only cheetahs cannot retract their claws.",
    "Siamese kittens are born white because of the heat inside the mother's uterus before birth. This heat keeps the kittens' hair from darkening on the points.",
    "Since cats are so good at hiding illness, even a single instance of a symptom should be taken very seriously.",
    "Smuggling a cat out of ancient Egypt was punishable by death. Phoenician traders eventually succeeded in smuggling felines, which they sold to rich people in Athens and other important cities.",
    "Some Siamese cats appear cross-eyed because the nerves from the left side of the brain go to mostly the right eye and the nerves from the right side of the brain go mostly to the left eye. This causes some double vision, which the cat tries to correct by “crossing” its eyes.",
    "Some cats have survived falls of over 65 feet (20 meters), due largely to their “righting reflex.” The eyes and balance organs in the inner ear tell it where it is in space so the cat can land on its feet. Even cats without a tail have this ability.",
    "Some common houseplants poisonous to cats include English Ivy, Iris, Mistletoe, Philodendron, and Yew.",
    "Some notable people who disliked cats:  Napoleon Bonaparte, Dwight D. Eisenhower, Hitler.",
    "Spanish-Jewish folklore recounts that Adam’s first wife, Lilith, became a black vampire cat, sucking the blood from sleeping babies. This may be the root of the superstition that a cat will smother a sleeping baby or suck out the child’s breath.",
    "Statistics indicate that animal lovers in recent years have shown a preference for cats over dogs.",
    "Tests done by the Behavioral Department of the Musuem of Natural History conclude that while a dog's memory lasts about 5 minutes, a cat's recall can last as long as 16 hours.",
    "The Amur leopard is one of the most endangered animals in the world.",
    "The Ancient Egyptian word for cat was mau, which means 'to see'.",
    "The Egyptian Mau is probably the oldest breed of cat. In fact, the breed is so ancient that its name is the Egyptian word for 'cat'.",
    "The Maine Coon cat is America's only natural breed of domestic feline. It is 4 to 5 times larger than the Singapura, the smallest breed of cat.",
    "The Maine Coon is 4 to 5 times larger than the Singapura, the smallest breed of cat.",
    "The Maine Coone is the only native American long haired breed.",
    "The Pilgrims were the first to introduce cats to North America.",
    "The ability of a cat to find its way home is called “psi-traveling.” Experts think cats either use the angle of the sunlight to find their way or that cats have magnetized cells in their brains that act as compasses.",
    "The ancestor of all domestic cats is the African Wild Cat which still exists today.",
    "The average cat food meal is the equivalent to about five mice.",
    "The average lifespan of an outdoor-only cat is about 3 to 5 years while an indoor-only cat can live 16 years or much longer.",
    "The average litter of kittens is between 2 - 6 kittens.",
    "The biggest wildcat today is the Siberian Tiger. It can be more than 12 feet (3.6 m) long (about the size of a small car) and weigh up to 700 pounds (317 kg).",
    "The cat appears to be the only domestic companion animal not mentioned in the Bible.",
    "The cat has 500 skeletal muscles (humans have 650).",
    "The cat who holds the record for the longest non-fatal fall is Andy. He fell from the 16th floor of an apartment building (about 200 ft/61 m) and survived.",
    "The cat's clavicle, or collarbone, does not connect with other bones but is buried in the muscles of the shoulder region. This lack of a functioning collarbone allows them to fit through any opening the size of their head.",
    "The cat's footpads absorb the shocks of the landing when the cat jumps.",
    "The cat's front paw has 5 toes, but the back paws have 4. Some cats are born with as many as 7 front toes and extra back toes (polydactl).",
    "The cat's tail is used to maintain balance.",
    "The cheetah is the world's fastest land mammal. It can run at speeds of up to 70 miles (113 kilometers) an hour.",
    "The chlorine in fresh tap water irritates sensitive parts of the cat's nose. Let tap water sit for 24 hours before giving it to a cat.",
    "The claws on the cat’s back paws aren’t as sharp as the claws on the front paws because the claws in the back don’t retract and, consequently, become worn.",
    "The earliest ancestor of the modern cat lived about 30 million years ago. Scientists called it the Proailurus, which means “first cat” in Greek. The group of animals that pet cats belong to emerged around 12 million years ago.",
    "The female cat reaches sexual maturity within 6 to 10 months; most veterinarians suggest spaying the female at 5 months, before her first heat period. The male cat usually reaches sexual maturity between 9 and 12 months.",
    "The first cartoon cat was Felix the Cat in 1919. In 1940, Tom and Jerry starred in the first theatrical cartoon “Puss Gets the Boot.” In 1981 Andrew Lloyd Weber created the musical Cats, based on T.S. Eliot’s Old Possum’s Book of Practical Cats.",
    "The first cat in space was a French cat named Felicette (a.k.a. “Astrocat”). In 1963, France blasted the cat into outer space. Electrodes implanted in her brains sent neurological signals back to Earth. She survived the trip.",
    "The first cat show was in 1871 at the Crystal Palace in London.",
    "The first commercially cloned pet was a cat named 'Little Nicky'. He cost his owner $50,000, making him one of the most expensive cats ever.",
    "The first true cats came into existence about 12 million years ago and were the Proailurus.",
    "The group of words associated with cat (catt, cath, chat, katze) stem from the Latin catus, meaning domestic cat, as opposed to feles, or wild cat.",
    "The heaviest cat on record is Himmy, a Tabby from Queensland, Australia. He weighed nearly 47 pounds (21 kg). He died at the age of 10.",
    "The largest cat breed is the Ragdoll. Male Ragdolls weigh between 12 and 20 lbs (5.4-9.0 k). Females weigh between 10 and 15 lbs (4.5-6.8 k).",
    "The leopard is the most widespread of all big cats.",
    "The life expectancy of cats has nearly doubled since 1930 - from 8 to 16 years.",
    "The lightest cat on record is a blue point Himalayan called Tinker Toy, who weighed 1 pound, 6 ounces (616 g). Tinker Toy was 2.75 inches (7 cm) tall and 7.5 inches (19 cm) long.",
    "The little tufts of hair in a cat’s ear that help keep out dirt direct sounds into the ear, and insulate the ears are called 'ear furnishings'.",
    "The most expensive cat was an Asian Leopard cat (ALC)-Domestic Shorthair (DSH) hybrid named Zeus. Zeus, who is 90% ALC and 10% DSH, has an asking price of £100,000 ($154,000).",
    "The most popular pedigreed cat is the Persian cat, followed by the Main Coon cat and the Siamese cat.",
    "The most traveled cat is Hamlet, who escaped from his carrier while on a flight. He hid for seven weeks behind a panel on the airplane. By the time he was discovered, he had traveled nearly 373,000 miles (600,000 km).",
    "The name 'jaguar' comes from a Native American word meaning 'he who kills with one leap'.",
    "The oldest cat on record was Crème Puff from Austin, Texas, who lived from 1967 to August 6, 2005, three days after her 38th birthday. A cat typically can live up to 20 years, which is equivalent to about 96 human years.",
    "The oldest cat to give birth was Kitty who, at the age of 30, gave birth to two kittens. During her life, she gave birth to218 kittens.",
    "The richest cat is Blackie who was left £15 million by his owner, Ben Rea.",
    "The silks created by weavers in Baghdad were inspired by the beautiful and varied colors and markings of cat coats. These fabrics were called 'tabby' by European traders.",
    "The smallest pedigreed cat is a Singapura, which can weigh just 4 lbs (1.8 kg), or about five large cans of cat food. The largest pedigreed cats are Maine Coon cats, which can weigh 25 lbs (11.3 kg), or nearly twice as much as an average cat weighs.",
    "The smallest wildcat today is the Black-footed cat. The females are less than 20 inches (50 cm) long and can weigh as little as 2.5 lbs (1.2 kg).",
    "The strongest climber among the big cats, a leopard, can carry prey twice its weight up a tree.",
    "The technical term for a cat’s hairball is a 'bezoar'.",
    "The term “puss” is the root of the principal word for “cat” in the Romanian term pisica and the root of secondary words in Lithuanian (puz) and Low German puus. Some scholars suggest that “puss” could be imitative of the hissing sound used to get a cat’s attention. As a slang word for the female pudenda, it could be associated with the connotation of a cat being soft, warm, and fuzzy.",
    "The tiniest cat on record is Mr. Pebbles, a 2-year-old cat that weighed 3 lbs (1.3 kg) and was 6.1 inches (15.5 cm) high.",
    "The way you treat kittens in the early stages of it's life will render it's personality traits later in life.",
    "The world’s rarest coffee, Kopi Luwak, comes from Indonesia where a wildcat known as the luwak lives. The cat eats coffee berries and the coffee beans inside pass through the stomach. The beans are harvested from the cat’s dung heaps and then cleanedand roasted. Kopi Luwak sells for about $500 for a 450 g (1 lb) bag.",
    "There are approximately 60,000 hairs per square inch on the back of a cat and about 120,000 per square inch on its underside.",
    "There are more than 500 million domestic cats in the world, with approximately 40 recognized breeds.",
    "There are up to 60 million feral cats in the United States alone.",
    "There is a species of cat smaller than the average housecat. It is native to Africa and it is the Black-footed cat (Felis nigripes). Its top weight is 5.5 pounds.",
    "Tigers are excellent swimmers and do not avoid water.",
    "Two members of the cat family are distinct from all others: the clouded leopard and the cheetah. The clouded leopard does not roar like other big cats, nor does it groom or rest like small cats. The cheetah is unique because it is a running cat; all others are leaping cats. They are leaping cats because they slowly stalk their prey and then leap on it.",
    "Tylenol and chocolate are both poisonous to cats.",
    "Unlike dogs, cats do not have a sweet tooth. Scientists believe this is due to a mutation in a key taste receptor.",
    "Unlike humans, cats do not need to blink their eyes on a regular basis to keep their eyes lubricated.",
    "Unlike other cats, lions have a tuft of hair at the end of their tails.",
    "When a cat chases its prey, it keeps its head level. Dogs and humans bob their heads up and down.",
    "When a cat drinks, its tongue - which has tiny barbs on it - scoops the liquid up backwards.",
    "When a cats rubs up against you, the cat is marking you with it's scent claiming ownership.",
    "When a domestic cat goes after mice, about 1 pounce in 3 results in a catch.",
    "While it is commonly thought that the ancient Egyptians were the first to domesticate cats, the oldest known pet cat was recently found in a 9,500-year-old grave on the Mediterranean island of Cyprus. This grave predates early Egyptian art depicting cats by 4,000 years or more.",
    "While many parts of Europe and North America consider the black cat a sign of bad luck, in Britain and Australia black cats are considered lucky.",
    "You check your cats pulse on the inside of the back thigh, where the leg joins to the body.",
    "In 1987 cats overtook dogs as the number one pet in America.",
    "Auxim's cat Lotje is not only lazy, but also incredibly lazy.",
    "Cats use their tails for balance and have nearly 30 individual bones in them!",
    "In ancient Egypt killing a cat was a crime punishable by death.",
    "The first cat show was held in 1871 at the Crystal Palace in London? Mee-wow!",
    "There are about 100 distinct breeds of domestic cats? Plenty of furry love!",
    "Cats bury their feces to cover their trails from predators.",
    "Some cats have survived falls from over 32 stories onto concrete, due largely to their 'Righting reflex.'",
    "Every year, nearly four million cats are eaten in China as a delicacy.",
    "Cats have 32 Muscles that control the outer ear while humans have only 6.",
    "Cats sleep for 70% of their lives.",
    "The longest domestic cat ever measured was 48.5 inches when fully streched out.",
    "The oldest video of cats on Youtube dates from 1894. Here it is! https//www.youtube.com/watch?v=r6faUd2fV4U",
    "In tigers and tabbies, the middle of the tongue is covered in backward-pointing spines, used for breaking off and gripping meat.",
    "When cats grimace, they are usually “taste-scenting.” They have an extra organ that, with some breathing control, allows the cats to taste-sense the air.",
    "Cats can’t taste sweetness.",
    "Owning a cat can reduce the risk of stroke and heart attack by a third.",
    "Evidence suggests domesticated cats have been around since 3600 B.C., 2,000 years before Egypt’s pharaohs.",
    "A cat’s purr may be a form of self-healing, as it can be a sign of nervousness as well as contentment.",
    "The frequency of a domestic cat’s purr is the same at which muscles and bones repair themselves.",
    "The world’s richest cat is worth $13 million after his human passed away and left her fortune to him.",
    "The technical term for “hairball” is “bezoar.”",
    "In the 1960s, the CIA tried to turn a cat into a bonafide spy by implanting a microphone into her ear and a radio transmitter at the base of her skull. She somehow survived the surgery but got hit by a taxi on her first mission.",
    "Female cats are typically right-pawed while male cats are typically left-pawed.",
    "Cats make more than 100 different sounds whereas dogs make around 10.",
    "A cat’s brain is 90% similar to a human’s — more similar than to a dog’s.",
    "Cats and humans have nearly identical sections of the brain that control emotion.",
    "A cat’s cerebral cortex (the part of the brain in charge of cognitive information processing) has 300 million neurons, compared with a dog’s 160 million.",
    "Cats have a longer-term memory than dogs, especially when they learn by actually doing rather than simply seeing.",
    "Cats have 1,000 times more data storage than an iPad.",
    "In the 15th century, Pope Innocent VIII began ordering the killing of cats, pronouncing them demonic.",
    "A cat has five toes on his front paws, and four on the back, unless he’s a polydactyl.",
    "Polydactyl cats are also referred to as “Hemingway cats” because the author was so fond of them.",
    "There are 45 Hemingway cats living at the author’s former home in Key West, FL.",
    "Original kitty litter was made out of sand but it was replaced by more absorbent clay in 1948.",
    "Abraham Lincoln kept four cats in the White House.",
    "When asked if her husband had any hobbies, Mary Todd Lincoln is said to have replied “cats.”",
    "Isaac Newton is credited with inventing the cat door.",
    "One legend claims that cats were created when a lion on Noah’s Ark sneezed and two kittens came out.",
    "A cat can jump up to six times its length.",
    "A house cat is faster than Usain Bolt.",
    "When cats leave their poop uncovered, it is a sign of aggression to let you know they don’t fear you.",
    "Cats can change their meow to manipulate a human. They often imitate a human baby when they need food, for example.",
    "Cats use their whiskers to detect if they can fit through a space.",
    "Cats only sweat through their foot pads.",
    "The first cat in space was French. She was named Felicette, or “Astrocat.” She survived the trip.",
    "Cats have free-floating clavicle bones that attach their shoulders to their forelimbs, which allows them to squeeze through very small spaces.",
    "Hearing is the strongest of cat’s senses They can hear sounds as high as 64 kHz — compared with humans, who can hear only as high as 20 kHz.",
    "Cats can move their ears 180 degrees.",
    "A cat’s nose is ridged with a unique pattern, just like a human fingerprint.",
    "Cats have scent glands along their tail, their forehead, lips, chin, and the underside of their front paws.",
    "Cats lick themselves to get your scent off.",
    "Black cats are bad luck in the United States, but they are good luck in the United Kingdom and Australia.",
    "Most cats don’t like water because their coats do not insulate them well enough.",
    "The Egyptian Mau is the oldest breed of cat.",
    "The Egyptian word for cat is, in fact, “mau.”",
    "Only 11.5% of people consider themselves “cat people.”",
    "A cat’s carbon footprint is similar to that of a VW Bug, whereas a dog’s is more like a Hummer.",
    "When your cat brings home a dead mouse or bird, it may do so to show you that you suck at hunting.",
    "Cats have inferior daytime sight, but during the night they need seven times less light than humans to see.",
    "The largest litter of kittens produced 19 kittens.",
    "Eighty-eight percent of cats in the U.S. are spayed or neutered (in 2015)",
    "Only 24% of cats who enter animal shelters are adopted.",
    "Cats are, in fact, superior to dogs!",
    "Koko the gorilla got a pet cat for her birthday in 1985 after she requested to have one as a birthday present.",
    "Basically all cartoon cats lied to us: Raw fish is off the table for cats as well.",
    "Cats can hear the ultrasonic noises that rodents and dolphins make to communicate.",
    "A man named Ernest Misko gave marijuana tinctures to his 24-year-old cat, Borzo. In a couple of days, he was walking normally again, pain-free. Veterinarians in many states are still not legally allowed to prescribe cannabis to cats, even in states that have legalized medicinal marijuana for humans.",
    "Cats make about 100 different sounds. Dogs make only about 10.",
    "There are 45 Hemingway cats living at the author's former home in Key West, Fla.",
    "Adult cats only meow to communicate with humans.",
    "By the time a cat is 9 years old, it will only have been awake for three years of its life.",
    "A house cat is faster than Usain Bolt.",
    "In the 1960s, the CIA tried to turn a cat into a bonafide spy by implanting a microphone into her ear and a radio transmitter at the base of her skull. She somehow survived the surgery but got hit by a taxi on her first mission.",
    "It was illegal to slay cats in ancient Egypt, in large part because they provided the great service of controlling the rat population.",
    "The Egyptian Mau’s name is derived from the Middle Egyptian word mjw, which means cat. But contrary to its name, it’s unclear whether the modern Egyptian Mau actually originated in Egypt.",
    "Cats aren’t the only animals that purr — squirrels, lemurs, elephants, and even gorillas purr too.",
    "Cat owners are 17% more likely to have a graduate degree than non cat owners.",
    "Cats can distinguish different flavors in water.",
    "The oldest cat video on YouTube dates back to 1894.",
    "Cats sleep 70% of their lives.",
    "The goddess of love, beauty, and fertility in Norse mythology, Freyja was the first cat lady. She is depicted in stories as riding a chariot that was drawn by cats.",
    "The technical term for a cat’s hairball is a bezoar.",
    "People who own cats have on average 2.1 pets per household, where dog owners have about 1.6.",
    "Female cats are typically right-pawed while male cats are typically left-pawed.",
    "Cats and humans have nearly identical sections of the brain that control emotion.",
    "The world's largest cat measured 48.5 inches long.",
    "Original kitty litter was made out of sand but it was replaced by more absorbent clay in 1948.",
    "Every year, nearly four million cats are eaten in China as a delicacy.",
    "A cat's cerebral cortex (the part of the brain in charge of cognitive information processing) has 300 million neurons, compared with a dog's 160 million.",
    "In the 15th century, Pope Innocent VIII began ordering the killing of cats, pronouncing them demonic.",
    "The special sensory organ called the Jacobson's organ allows a cat to have 14 times the sense of smell of a human. It consists of two fluid-filled sacs that connect to the cat's nasal cavity and is located on the roof of their mouth behind their teeth.",
    "Scottish sailer Alexander Selkirk once survived for 4 years on a deserted island thanks to feral cats that protected him from large rats during the night.",
    "A cat has five toes on his front paws, and four on the back, unless he's a polydactyl.",
    "Cats use their whiskers to detect if they can fit through a space.",
    "Cats love to eat olives or for that matter anything preserved in brine.",
    "Here is a video of some cats in zero gravity. youtu.be/O9XtK6R1QAk",
    "Cats knead because of seperation from their mothers",
    "Kangaroos can't hop backwards",
    "America’s cats, including housecats that adventure outdoors and feral cats, kill between 1.3 billion and 4.0 billion birds in a year.",
    "Wikipedia has a recording of a cat meowing, because why not?",
    "The myth that a cat has nine lives comes from their ability to jump and land from high places. The number 9 is believed by some to originate from William Shakespeare's Romeo and Juliet: A cat has nine lives. For three he plays, for three he strays, and for the last three he stays.",
    "Exposure to UV light with hairless or partially-hairless cats can result in sunburn, even during cloudy or shady conditions. If your cat risks overexposure, consider applying sunscreen daily.",
    "There are cats who have survived falls from over 32 stories (320 meters) onto concrete.",
    "Most cats don't like water because their coats do not insulate them well enough.",
    "A cat’s nose pad is ridged with a unique pattern, just like the fingerprint of a human.",
    "The technical term for hairball is bezoar.",
    "Cats make more than 100 different sounds whereas dogs make around 10.",
    "A cat's brain is 90% similar to a human's — more similar than to a dog's.",
    "Cats can survive falls from up to 65 feet or more.",
    "In 1879, Belgium unsuccessfully tried to use cats to deliver mail.",
    "Lil' Bunny Sue Roux is a cat who was born with no front legs, and walks upright like a kangaroo. https://www.instagram.com/lilbunnysueroux",
    "Evidence suggests domesticated cats have been around since 3600 B.C., 2,000 years before Egypt's pharaohs.",
    "Since cats treat us like cats and depend on us for things like food, water, and opening the door to let them out, they do recognize, that we are in some way in charge — the “big cat” in the shared territory. As territorial animals, our cats are constantly wondering why we’re not doing other cat things that the big cat would normally do in their territory. In fact, the “let me in, let me out, let me in” phenomenon is a good example. The bigger cat ostensibly rules the territory and therefore should be the one patrolling and marking it with pee so other cats stay away. But since humans don’t do this, indoor-outdoor cats reluctantly take on the role themselves. The apparent neuroticism of cats wanting to go outside every five minutes only to be let right back in is funny to us because it seems so silly and unnecessary. But to the cats, it’s very necessary (and frustrating) to cover for their dumb pals.",
    "Cats are the most popular pet in the United States: There are 88 million pet cats and 74 million dogs.",
    "In tigers and tabbies, the middle of the tongue is covered in backward-pointing spines, used for breaking off and gripping meat.",
    "The world's richest cat is worth $13 million after his human passed away and left her fortune to him.",
    "When cats grimace, they are usually taste-scenting. They have an extra organ that, with some breathing control, allows the cats to taste-sense the air.",
    "A cat's purr may be a form of self-healing, as it can be a sign of nervousness as well as contentment.",
    "Your cat recognizes your voice but just acts too cool to care (probably because they are).",
    "Cats have a longer-term memory than dogs, especially when they learn by actually doing rather than simply seeing.",
    "Polydactyl cats are also referred to as Hemingway cats because the author was so fond of them.",
    "When asked if her husband had any hobbies, Mary Todd Lincoln is said to have replied cats.",
    "Cats can change their meow to manipulate a human. They often imitate a human baby when they need food, for example.",
    "One legend claims that cats were created when a lion on Noah's Ark sneezed and two kittens came out.",
    "In Korea and Japan, there is a Cat Cafe where you can go to drink coffee and hang out with cats for hours.",
    "When cats leave their poop uncovered, it is a sign of aggression to let you know they don't fear you.",
    "Owning a cat can reduce the risk of heart attacks and strokes by more than a third, researchers found.",
    "A cat can’t climb head first down a tree because every claw on a cat’s paw points the same way. To get down from a tree, a cat must back down.",
    "Some Siamese cats appear cross-eyed because the nerves from the left side of the brain go to mostly the right eye and the nerves from the right side of the brain go mostly to the left eye. This causes some double vision, which the cat tries to correct by “crossing” its eyes.",
    "The claws on the cat’s back paws aren’t as sharp as the claws on the front paws because the claws in the back don’t retract and, consequently, become worn.",
    "Issac Newton decided to invent the cat flap because his own cat, Spithead, kept opening the door and spoiling his light experiments.",
    "Owning a cat can reduce the risk of stroke and heart attack by a third.",
    "The Indiana State Prison allows prisoners to adopt a cat and keep it in their cell. They are meant to improve the mood of the prisoners.",
    "In Islam, cats are revered for their cleanliness. Muhammad is reported to have said that a love of cats is an aspect of faith.",
    "A cat named Emmy lived aboard the RMS Empress of Ireland and she never missed a voyage. On May 28,1914, however, she refused to board. The ship left without her and then sank the following day.",
    "Domestic cats will try not to drink from a water bowl that is next to their food. This is because in the wild, water next to their kill could be contaminated.",
    "A Chinese cat named Baidianr (meaning white spot) had a unique ability to choose World Cup winners. He predicted the winner of the soccer competition 6 years in a row, before he died on June 2, 2018, just before the event ended.",
    "Cats have a layer called the tapetum lucidum just behind their retina which reflects light inside the eye, helping it capture more light. This reflected light is the glow you see when taking a photo of a cat with the flash on.",
    "Most cats are lactose intolerant, and milk can cause painful stomach cramps and diarrhea. It's best to forego the milk and just give your cat the standard: clean, cool drinking water.",
    "When cats run, their backs contract and extend to give them maximum stride. Their shoulder blades are not attached with bone, but with muscle, and this gives a cat even greater extension and speed.",
    "In most US states, declawing cats is legal but in the European Union it is not.",
    "Kittens sleep so much because the growth hormone is only released when they sleep.",
    "It has been estimated that a cat yawns on the average of 109,500 times in his life.",
    "A cat can jump up to six times its length.",
    "Cats only sweat through their foot pads.",
    "A female cat is called a “molly” or a “queen”.",
    "Black cats are less likely to be adopted because of their appearance.",
    "Cats were mythic symbols of divinity in ancient Egypt.",
    "Cats have 38 chromosomes in each zygote cell.",
    "If they have ample water, cats can tolerate temperatures up to 133 °F.",
    "Your cat's instincts tell her that a paperweight or knickknack could turn out to be a mouse. Her poking paw would send it scurrying, giving her a good game. This is probably why cats always seem to be knocking the glasses off your counter tops!",
    "For a cat at rest, the average heart rate usually is between 150 and 180 bpm, more than twice that of a human, which averages 70 bpm.",
    "Compared to other felines, domestic cats have narrowly spaced canine teeth, adapted to their preferred prey of small rodents.",
    "Cats, like dogs, are digitigrades. They walk directly on their toes, with the bones of their feet making up the lower part of the visible leg.",
    "A cat's kidneys are so efficient, it can survive on a diet consisting only of meat, with no additional water, and can even rehydrate by drinking seawater.",
    "Most breeds of cat have a noted fondness for settling in high places, or perching. In the wild, a higher place may serve as a concealed site from which to hunt.",
    "The ability of a cat to reflexively twist its body and balance itself during a fall is known as the cat righting reflex.",
    "The cat's tongue has backwards-facing spines about 500 μm long, which are called papillae. These contain keratin which makes them rigid so the papillae act like a hairbrush.",
    "Hank the Cat was a Maine Coon feline that was put up as a joke candidate in the 2012 United States Senate election in Virginia, a feat which gained international coverage after Hank reportedly came third behind the two major candidates, including Vice Presidential candidate Tim Kaine.",
    "A cat can die from essential oils",
    "Hearing is the strongest of cat's senses: They can hear sounds as high as 64 kHz — compared with humans, who can hear only as high as 20 kHz.",
    "Cats have free-floating clavicle bones that attach their shoulders to their forelimbs, which allows them to squeeze through very small spaces.",
    "Colonel Meow, a Himalayan-Persian mix who became famous on social media websites for his extremely long fur and scowling face, holds the Guinness world record for longest hair on a cat (nine inches).",
    "Towser The Mouser of Glenturret Distillery in Crieff, Scotland, holds the Guinness World Record for the most mice caught (28,899).",
    "The cat who holds the record for the longest non-fatal fall is Andy. He fell from the 16th floor of an apartment building (about 200 ft/.06 km) and survived.",
    "A cat’s eyesight is both better and worse than humans. It is better because cats can see in much dimmer light and they have a wider peripheral view. It’s worse because they don’t see color as well as humans do. Scientists believe grass appears red to cats.",
    "The lightest cat on record is a blue point Himalayan called Tinker Toy, who weighed 1 pound, 6 ounces (616 g). Tinker Toy was 2.75 inches (7 cm) tall and 7.5 inches (19 cm) long.",
    "The first cartoon cat was Felix the Cat in 1919. In 1940, Tom and Jerry starred in the first theatrical cartoon “Puss Gets the Boot.” In 1981 Andrew Lloyd Weber created the musical Cats, based on T.S. Eliot’s Old Possum’s Book of Practical Cats.",
    "The most traveled cat is Hamlet, who escaped from his carrier while on a flight. He hid for seven weeks behind a panel on the airplane. By the time he was discovered, he had traveled nearly 373,000 miles (600,000 km).",
    "The little tufts of hair in a cat’s ear that help keep out dirt direct sounds into the ear, and insulate the ears are called ear furnishings.",
    "The Australian Wildlife Conservancy completed a 44km cat-proof fence in 2018 to prevent feral cats from entering the Newhaven wildlife sanctuary, who kill about a million native birds every night across Australia and have caused the extinction of 20 native species.",
    "Black cats are bad luck in the United States, but they are good luck in the United Kingdom and Australia.",
    "The cat skull is unusual among mammals in having very large eye sockets and a powerful and specialized jaw.",
    "Cats have scent glands along their tail, their forehead, lips, chin, and the underside of their front paws.",
    "The french tuxedo kitty, Félix, aka Astrocat, was the first cat to go to space. She survived the trip.",
    "A male cat is called a tom.",
    "Thank to an extremely efficient pair of kidneys, cats can hydrate themselves by drinking salt water.",
    "A cats whiskers are the exact width of their body.",
    "At night, Disneyland is overrun by cats. The theme park feeds them and takes care of them though, because they keep the rodent population in check.",
    "Cats lack antibodies against dog blood so they can only receive it via a transfusion once. The second time would kill them.",
    "Oftentimes shelters won't let black cats be adopted around Halloween out of a fear that they may be sacrificed.",
    "When cats bring dead animals back to their humans, they are teaching them to hunt as they would with a younger cat.",
    "Cat fanciers bred and exhibited Maus in Europe until World War II, when attention toward the cat waned and it nearly went extinct.",
    "The Egyptian Mau breed was saved from extinciton when Russian princess Natalie Trubetskaya was given a Mau that was imported from the Middle East. When she emigrated to New York City in 1956, she brought along three Mau cats. She used these kitties to establish the Fatima Egyptian Mau cattery, which produced many of the ancestors of today’s Egyptian Maus in America.",
    "Unlike kittens, adult cats don’t release any particular key hormones during sleep. They snooze all day just because they can. :)",
    "Russian scientists discovered in the 1930s that Siamese kittens kept in very warm rooms didn't develop the breed's signature dark patches.",
    "Cats have a third eyelid called a “haw”. It’s generally only visible when they’re unwell.",
    "In the original Italian version of Cinderella, the benevolent fairy godmother figure was a cat.",
    "A cat was mayor of Talkeetna, Alaska, for 20 years. His name is Stubbs, and he died on July 23, 2017.",
    "Many people think that the Turkish Van is simply a color variation of the Turkish Angora, but in fact, they are distinct breeds that developed in different parts of Turkey.",
    "The Bengal is the result of crossbreeding between domestic cats and Asian leopard cats, and its name is derived from the scientific name for the Asian leopard cat (Felis bengalensis).",
    "Despite its traditionally wild roots, the Bengal is domestic and will gladly make itself in the indoor jungle of your home.",
    "Cat's cannot see in total darkness, however their vision is much better than a human's in semidarkness because their retinas are much more sensitive to light.",
    "The gene that codes orange fur is on the X chromosome, so female cats must inherit two orange genes to end up with orange fur, while male cats only need one.",
    "The Manx hails from the Isle of Man in the Irish Sea, and many Manx are tailless, a condition believed to have been caused by a dominant genetic mutation that spread among the island's cat population.",
    "Leonardo da Vinci created a series of drawings titled Study of Cat Movements and Positions, which consists of more than twenty drawings of cats and lions lying a sleep, sitting, playing, and fighting.",
    "The Chartreux is distinguished by a woolly blue-grey coat, a robust body poised over small paws, and full cheeks with a mouth that always appear to be smiling.",
    "While Chartreux cats aren't very vocal, they are sociable and communicate through eye contact and body language.",
    "Cats love playing with yarn, ribbons, and fishing-rode style toys. However, cats should not be left alone with anything that they could get tangled in.",
    "All Scottish Folds descended from Susie, a white barn cat discovered in Scotland in the early 1960s. Susie sported the breed's folded ears – the result of a genetic mutation – and passed on the trait through breeding.",
    "Mark Twain was undeniably an ailurophile. He had up to 19 cats at one time and gave them such memorable names as Beelzebub, Buffalo Bill, and Soapy Sal.",
    "If you really want to treat your cat, get some lactose-free milk at the grocery store and offer some to the kitty.",
    "Abraham Lincoln, being the ailurophile that he was, once rescued three stray kittens and ensured that they were fed and found homes.",
    "The Sphynx was originally known as the Canadian Hairless Cat. The breed originated in Toronto, and was renamed to Sphynx, a nod to the famous limestone sculpture in the Egyptian Desert.",
    "A cat’s spine can rotate more than the spines of most other animals, and their vertebrae have a special, flexible, elastic cushioning on the disks, which gives it even more flexibility.",
    "Cats have been domesticated for around 4,000 years. While they were once valued for their hunting abilities, they are now valued for their companionship and loving behavior.",
    "The most popular pedigreed cat in North America is the Persian cat, followed by the Main Coon and the Siamese cat.",
    "In the early 1980s, a Chinchilla Persian cat named Jemari Sanquist mated with a Lilac Burmese named Bambino Lilac Fabergé, producing the Burmilla breed.",
    "Scratching allows a cat to shed the outer layers of her claws, mark her territory, and stretch her body. Rather than discouraging the scratching behavior altogether, try redirecting your cat to a few scratching posts placed strategically around your home.",
    "The elegant Balinese is a longhaired variety of the Siamese, and like the Siamese, this stunning breed is sociable and intelligent. The breed was named for the grace of the dancers on the island of Bali in Indonesia.",
    "A large number of cats inhabit the Largo di Torre Argentina, an ancient Roman temple site near where Caesar was killed. Local volunteers care for the cats.",
    "Among the British government officials who keep things running smoothly at 10 Downing Street is Larry, a cat that holds the distinguished position of Chief Mouser. Larry's duties, according to the U.K. government, include greeting guests, testing antique furniture for napping quality, and contemplating a solution to the mouse occupancy of the house..",
    "The Norwegian Forest Cat is called skogcatt in its homeland of Norway and plays a role in the Norwegian fairy tales and legends.",
    "The Abyssinian, the Siamese, and the American Shorthair were crossbred to produce the Ocicat breed.",
    "Some animal shelters require kittens be adopted in pairs to ensure they came from the same litter.",
    "The Havana Brown breed hails from England, where it was created by crossbreeding Siamese cats with domestic black cats.",
    "While we don't know the exact origins of the Russian Blue, it's commonly believed the breed comes from the Archangel Isles in northwestern Russia—the region's cold climate would certainly explain the breed's plush coat.",
    "The wild-looking but domestic Ocicat is named for its resemblance to the ocelot, a small South American wild cat.",
    "Cats are among only a few animals that walk by moving their two right legs one after another and then their two left legs, rather than moving diagonal limbs simultaneously. Giraffes and camels also have this quality.",
    "The Turkish Van is often called the swimming cat because they are naturals in the water, thanks in part to their uniquely textured, water-resistant coat.",
    "GitHub is a cloud source version control system where its mascot is an octocat, an anthropomorphized cat with five tentacles.",
    "About one in two cats respond to catnip, and only develop a sensitivity to it at around 3 to 6 months of age.",
    "Due to the controversy, though loved by most, the Kashmir is overlooked by many cat fanciers.",
    "The Egyptian Mau is the oldest breed of cat, and is the fastest pedigreed cat.",
    "The domestic cat (Felis catus) is a small, typically furry, carnivorous mammal.",
    "Blackie became the richest cat in history when he inherited 15 million British Pounds.",
    "Cats have about 130,000 hairs per square inch (20,155 hairs per square centimeter).",
    "Many Egyptians worshipped the goddess Bast, who had a woman’s body and a cat’s head.",
    "Approximately 1/3 of cat owners think their pets are able to read their minds.",
    "The average female housecat could give birth to ove 100 kittens in her lifetime.",
    "Cats don't go through menopause, so they can continue to breed into their senior years.",
    "Cats like being brushed by their owners, because it reminds them of their mother.",
    "Loyal, playful, and alert, Manx are considered to be more doglike than other cats.",
    "According to the American Society for the Prevention of Cruelty of Animals, newborn kittens get all the nutrition they need duing the first four weeks of life fom their mother's milk. If you are taking care of a kitten without its mother, or if the mother isn't producing enough milk, you can feed the kitten a commercial milk substitute.",
    "When kittens ages to weeks five and six, they should start making the transition to dry food.",
    "Legend holds that the Chartreux once lived alongside the Carthusian monks of France.",
    "Bobtail cats owe their shortened tails to a natural genetic mutation that has appeared in cats across time and in various regions of the world. The American Bobtail can be traced back to Yodi, a cat with the mutation that was found in Arizona in the 1960s. Yodi passed the genetic quirk on to his kittens, thus creating a new breed.",
    "Traveling with cats can be stressful for everyone involved. Whether you're taking a kitty to the vet, or on a road trip, or on a flight, there are things you can do to help her stay relaxed in the carrier. Pet shops sell calming treats and sprays that can reduce a cat's anxiety. It might also help to put a beloved toy or a blanket in the carrier.",
    "A cat has 244 bones in its entire body—even more than a human, who only has 206 bones.",
    "The fear of cats is called Ailurophobia",
    "Cat owners are 25% likely to pick George Harrison as their favorite Beatle.",
    "Only 11.5% of people consider themselves cat people.",
    "Cat people are 11% more likely to be introverted than others.",
    "The place where Julius Caesar was murdered is now a cat sanctuary.",
    "The Bombay cat breed was developed to resemble a miniature panther.",
    "Cats use their whiskers to judge whether they’ll fit through a space.",
    "Among domestic cats, males are more likely to fight than females.",
    "The softest part of a cat is most definitely its cheek area.",
    "When a cat yawns, it's mouth opens so wide that you can count every tooth.",
    "Cats can move their ears 180 degrees.",
    "Like humans, cats tend to favor one paw over another.",
    "Approximately 40,000 people are bitten by cats in the U.S. annually.",
    "Kittens start to dream when they’re about a week old.",
    "Approximately 40% of cats have a dominant paw. The rest are ambidextrous.",
    "Cats can have three litters a year, or approximately 12 kittens.",
    "If you grow your own catnip, here's how to prepare it for kitty's enjoyment: Cut several stalks of the plant from the base. Hang them upside down in a dark and dry room for several weeks. Then cut the catnip into small pieces, rub some on your cat's favorite toys or scratching post, and let the games begin!",
    "Approximately 80% of orange tabbies are male.",
    "If you need to trim a cat's nails, choose a moment when he is relaxed. Massage his paws gently before clipping. Make sure you're using a pair of clippers specifically for cat's nails, not human nail clippers. Avoid cutting the nail too close to the quick, the pink part of a cat's nail, which is full of blood vessels and nerves.",
    "The collective noun for kittens is a kindle.",
    "Do you ever wake up in the middle of the night and find your cat sleeping on your head? Cat behavioral experts believe that cats are drawn to the warmth and the familiar scent of the owner. Resting on your head also keeps kitty safe from your arms and legs if you toss and turn through the night.",
    "The cheetah is the only cat that doesn't have retractable claws.",
    "There are only two escalators in the state of Wyoming.",
    "When a cat lifts its butt in the air when scratched, it is a sign that your feline is giving your pats an A+. However, if you have a female kitty who hasn't been spayed, elevator butt could be a sign that she's ready to mate. The proper name for this stance is lordosis, and cats adopt it when they're in heat.",
    "On October 24, 1963, a tuxedo cat named Félicette entered outer space aboard a French Véronique AG1 rocket and made feline history. Félicette returned from the 15-minute trip in once piece and earned the praise of French scientists, who said she made a valuable contribution to research..",
    "Cats can sense distress from a human being.",
    "Norwegian Forest Cats are usually very people friendly.",
    "During the heat of the summer, set out an extra bowl of water and place ice cubes in it to keep it cold and refreshing. Cats love to lie on cool surfaces when it's hot—if you don't have an tile in your home, consider buying a few ceramic tiles from a home improvement store for your cat to rest on.",
    "Courgars are the largest wild cats that can purr.",
    "Andy Warhol amassed quite the collection of feline friends during his lifetime, beginning with a Siamese cat named Hester that was given to him by actress Gloria Swanson. By breeding Hester with a cat named Sam, Warhol ended up with multiple litters of kittens, at one point housing 25 cats in his Upper East Side townhouse in NYC.",
    "While two kittens might sound like double trouble, adopting two at a time can actually make your job easier. Two cans can keep each other company, reducing their need for socialization, and they will expend energy by playing together. Kittens in the same litter often form tight sibling bonds.",
    "It's important for cats to have regular ear exams—this is something you can do at home! Gently fold back the ears and look into the ear canal. The inner ear should be pale pink with little to no earwax. If you notice redness, swelling, discharge, or a lot of earwax, it's time to see a veterinarian.",
    "Dr. Seuss wrote The Cat in the Hat using only 236 words.",
    "Cats conserve energy by sleeping for an average of 13 to 14 hours a day.",
    "Cats are capable of walking very precisely because, like all felines, they directly register; that is, they place each hind paw (almost) directly in the print of the corresponding fore paw, minimizing noise and visible tracks. This also provides sure footing for their hind paws when they navigate rough terrain.",
    "Some cats do not eat fish.",
    "Cats can climb on trees faster than squirels.",
    "Cats can hear the ultrasonic noises that rodents and dolphins make to communicate.",
    "A house cat is faster than Usain Bolt.",
    "The stationmaster of the Kishi rail station in western Japan until 2015 was a cat named Tama. The calico cat wore a stationmaster's cap and greeted visitors by the ticket gate. After her death, Tama was elevated to the status of a goddess in a Shinto-style funeral.",
    "In Norse mythology, the goddess Freya travels in a chariot pulled by two cats—specifically Norwegian Forest Cats.",
    "American Curl kittens are born with straight ears, but the ears begin to curl back after just a few days.",
    "If your cat licks from the toilet, bathtub, or sink, she may be telling you something about the water bowl. Make sure it's clean, replace the water regularly to keep it from getting stale or developing a film on top, and if necessary, get a new bowl. Some cats prefer glass bowls to plastic.",
    "Georgia O'Keeffe was a celebrated painter, a figurehead of American modernism, a fashion icon, and... a cat owner! O'Keeffe kept a number of animals at her home in New Mexico, including her pet Siamese cat, who appears alongside O'Keeffe in a portrait shot by photographer John Candelario.",
    "The pink substance inside a cat's nail is called the quick or the dermis. When trimming your cat's nails, be sure to only cut the upper white part of the nail, not the quick.",
    "The irresistable and cuddly Ragamuffin is the result of crossbreeding Ragdoll cats with Persians, Himalayans, and other larger longhaired breeds.",
    "Legend holds that a goddess rewarded a temple cat's piety by turning the cat's eyes blue and his coat golden, thus creating the first Birman cat.",
    "While some cats love being brushed, others don't take to it naturally. Try to groom your cat in the same spot at the same time of day to create a sense of routine.",
    "Kittens typically begin to engage in playful behavior at around four weeks of age.",
    "Ancient sailors believed that cats were magic and would often risk their own lives, even in an every man for himself situation, to save a cat from a sinking ship. All ships had at least one ship's cat as cats would eat the rats that have always plagued ships. The ship's cat would often be given a rank and sailors would generally take excessively good care of their cats.",
    "Originally it was thought that Egyptians domesticated the cat. However, in 2004 French archaeologists discovered a 9,500 year old cat grave in Cyprus. This makes this the oldest known pet cat and it predates Egyptian art about cats by over 4,000 years",
    "Have you ever noticed that cats walk like camels and giraffes? Their walking sequence is both right feet first, followed by both left feet, so they move half of their body forward at once. Camels and giraffes are the only other animals to walk this way.",
    "You’ve heard of monkeys and dogs in space, but did you know that a cat braved the great unknown too? On October 18th 1963 Felicette, also known as 'Astrocat' was the first and only cat to go to space.",
    "A study discovered that our little house cats share 95.6% of their genetic makeup with tigers! They also share a lot of the same behaviours such as scent and urine marking, prey stalking and pouncing.",
    "The record for the loudest purr by a domestic cat is currently held by Merlin, a black and white cat from Torquay, UK. His purr is 67.8db(A) and for context, this is nearly the same volume as a shower! Most cats purr at around 25db.",
    "The most tricks performed by a cat in one minute is 24! One cat completed a series of tricks from rolling over, to even jumping a bar whilst on a skateboard!",
    "You're best for following this channel. Thank you.",
    "Cats sleep most of the time.",
    "The saying, 'A cat always lands on its feet' isn’t just an old myth. It’s actually accurate, in most cases at least! Cats have a natural ability to land on their feet called the 'righting reflex' .This reflex allows cats to quickly assess which way is down and rotate their bodies while in mid-air.",
    "The higher the fall, the more likely a cat is to survive it. It turns out that if a cat falls from a lower height, say less than 7 stories high, then it’s actually more likely to be injured! If a cat falls from a greater height, it has more time to correct its position mid-flight and prepare itself more for the landing. There are even reports of cats falling from as high as 32 stories high and coming away with just a chipped tooth and a punctured lung.",
    "There are many ways to refer to a group of cats. It really depends on the cats, too. The collective noun for wild cats, for example, is 'a destruction of cats'. Regular house cats are generally called a 'clowder of cats'. However they can also be called a 'glaring of cats' if the cats you’re referring to don’t know each other and are glaring at each other.",
    "Patting a cat has been proven to release oxytocin, which lowers stress levels.",
    "There’s a clear link between cat ownership and a lowered risk of strokes or heart problems, as a cat’s purr lowers blood pressure.",
    "It’s been scientifically proven that cat owners are healthier people as cats keep you from being lonely – and it’s now known that loneliness plays a big part in many diseases!",
    "Some cats have a slightly different purr for when they’re hungry",
    "While President Abraham Lincoln lived in the White House he kept a number of pet cats, most famously Dixie and Tabby."
]